Revit.Application.Warning.InternalWarning
Internal reference to the Document

Revit.Application.Warning.Description
Retrieves the description text of the warning.

Revit.Application.Warning.Severity
Retrieves the severity of the Warning.

Revit.Application.Warning.GetWarnings(Revit.Application.Document)
Returns a list of all warnings from the document.
document: The document to get the warnings from
Returns: List of all warnings

Revit.Application.Warning.GetFailingElements
Retrieves a list of the elements that have caused the failure.
Returns: The elements that have caused the failure.